snlkuharlocal/src/Documents/ПараметрыРасчётаПремии/ПараметрыРасчётаПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПараметрыРасчётаПремии</name>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.РаспределениеСотрудниковПоНаправлениямПродаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>КритерийНачисления</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноОплачиваемыйПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПриВыполненииСтаПроцентовПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/РаспределениеСотрудниковПоНаправлениямПродаж/РаспределениеСотрудниковПоНаправлениямПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РаспределениеСотрудниковПоНаправлениямПродаж</name>
  <attributes>
    <name>НаправлениеПродаж</name>
    <type>
      <types>CatalogRef.НаправленияПродаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПараметрыРасчётаПремии/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы     

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)   
	
	ВидНачисленияПриИзмененииНаСервере();  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗаполнитьОплачиваемыйПроцент(Команда)  
	
	УказанноеЧисло = Неопределено;
	ВвестиЗначение(УказанноеЧисло, "Укажите макс. %", Тип("Число"));
	Если УказанноеЧисло <> Неопределено И УказанноеЧисло > 0 Тогда
		Для Каждого ТекущаяСтрока Из Элементы.Параметры.ВыделенныеСтроки Цикл

			ДанныеСтроки = Элементы.Параметры.ДанныеСтроки(ТекущаяСтрока);
			ДанныеСтроки.МаксимальноОплачиваемыйПроцентВыполнения = УказанноеЧисло;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПремию(Команда)

	УказанноеЧисло = Неопределено;
	ВвестиЗначение(УказанноеЧисло, "Укажите премию", Тип("Число"));
	Если УказанноеЧисло <> Неопределено И УказанноеЧисло > 0 Тогда
		Для Каждого ТекущаяСтрока Из Элементы.Параметры.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.Параметры.ДанныеСтроки(ТекущаяСтрока);
			ДанныеСтроки.ПремияПриВыполненииСтаПроцентовПлана = УказанноеЧисло;
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Процедура ВидНачисленияПриИзмененииНаСервере()  
	
	Если ЗначениеЗаполнено(Объект.ВидНачисления) Тогда
		ЗаполнитьКритерииПоНаправлению();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКритерииПоНаправлению()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	Спр.Номенклатура КАК КритерийНачисления
				   |ИЗ
				   |	Справочник.РаспределениеСотрудниковПоНаправлениямПродаж.Товары КАК Спр
				   |ГДЕ
				   |	Спр.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", объект.ВидНачисления);
	Объект.Параметры.Загрузить(Запрос.Выполнить().Выгрузить());   
	
КонецПроцедуры

#КонецОбласти
